using System;

string[] mas = {    "освоении",
                    "остальное",
                    "по плечу",
                    "сложный",
                    "но если",
                "программирования",
                  "многие бросают",
                  "остальное будет",
                    "освоить их",
                     "этап в",
                   "на этом этапе",
                    "Массивы -"
                };
string[] mas1 = { "Массивы -", "сложный", "этап в", "освоении", "программирования", "многие бросают", "но если","освоить их", "на этом этапе", "остальное будет","по плечу", };
for (int i = 0; i < mas.Length; i++)
{
    Console.Write(mas1[i]+" ");
}
Console.WriteLine();
